Revit 2026 API

# InstanceVoidCutUtilsCanBeCutWithVoid Method

---

Indicates if the element can be cut by an instance with unattached voids.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CanBeCutWithVoid(
	Element element
)
```
```vb
Public Shared Function CanBeCutWithVoid (
	element As Element
) As Boolean
```
```cpp
public:
static bool CanBeCutWithVoid(
	Element^ element
)
```
```fsharp
static member CanBeCutWithVoid :
        element : Element -> bool
```

#### Parameters

element Element
     The element to be cut

#### Return Value

Boolean Returns true if the element can be cut by an instance with unattached voids.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Elements in a project can be cut if they are host elements or family instances with a category Generic Model or one of the structural categories.

#### Reference

InstanceVoidCutUtils Class

Autodesk.Revit.DB Namespace